Revit 2026 API

# Solid Properties

---

The Solid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Edges | The edges that belong to the solid. |
|  | Faces | The faces that belong to the solid. |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle(Inherited from GeometryObject) |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.(Inherited from GeometryObject) |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.(Inherited from GeometryObject) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | SurfaceArea | Returns the total surface area of this solid. |
|  | Visibility | The visibility.(Inherited from GeometryObject) |
|  | Volume | Returns the signed volume of this solid. |

#### Reference

Solid Class

Autodesk.Revit.DB Namespace